{
  "courses": [
    {
      "name": "Python & Django REST API Bootcamp – Build A Python Web API",
      "category": "Development",
      "image": "https://img-c.udemycdn.com/course/480x270/3769792_3990_5.jpg",
      "actual_price_usd": 84.99,
      "sale_price_usd": 0.0,
      "sale_end": "2025-01-24T10:51:00",
      "description": "Do you want to build a complete Python RESTful API that is not only secure and stable but also deployed to a production ready environment ready to serve thousands of users?  If Yes! Then this is the course for you! WHAT WILL WE BE BUILDING? In this course, we’ll use the best in Python and Django Rest Framework to build a complete REST API from scratch to deployment called Taskly that you can consume with any frontend framework of your choice. WHAT CONCEPTS ARE COVERED? JWT and OAUTH-2 Based Authentication Support for Filtering and Text Based Searching Create, Read, Update, Delete Functionality Protecting and Permissioning Routes Defining Custom Permissions For Users Uploading and Sharing Of Media Files Background Jobs Django Signals PostgresSQL and SQLite Databases alongside Django ORM Throttling and Pagination Support Deploying Django REST API to a Production Environment (Heroku) Use Google Cloud Storage as Media Storage Solution (CDN). Use Postman for testing REST API. Tons of Practical, Straightforward and Repeatable App-Building Patterns ​ And much more!​ WHAT ELSE DOES THIS COURSE OFFER? –  Deep, Fine-Grained Learning  – This course is jam-packed with information. I made the course that I most wanted to take and as a result, I didn’t skimp on the details. You’re going to cover more topics and material in greater depth than ever before. –  100% Real-World Practice  – My goal is to get you writing code as much as possible. And not just any code–we’ll be working exclusively on practical tasks that are instrumental in building your own amazing real-world apps. –  No-Nonsense, Spot-On Explanations –  Every lesson is to-the-point. I break down what we’re making, how we’ll be doing it and what the final product will look like, all on top of helpful and illustrative descriptions to aid your understanding along the way. I really enjoyed making this course and I think you’ll enjoy taking it just as much. Looking forward to seeing you within the course! Who this course is for: Python and web developers looking to build impressive real-world, production-ready RESTful API’s using Python and Django Rest Framework! Python developers looking for a challenge Developers looking to delve into the world of backend development.",
      "url": "https://www.udemy.com/course/the-complete-python-django-rest-api-development-bootcamp/?couponCode=EE34AA06610150B2950B",
      "clean_url": "https://www.udemy.com/course/the-complete-python-django-rest-api-development-bootcamp/"
    },
    {
      "name": "[NEW] Python PCAP-31-03 Certification – Tests & Insights",
      "category": "IT & Software",
      "image": "https://img-c.udemycdn.com/course/480x270/6280705_b1ff_3.jpg",
      "actual_price_usd": 19.99,
      "sale_price_usd": 0.0,
      "sale_end": "2025-01-26T18:07:00",
      "description": "Python PCAP-31-03 Certification - Tests & Insights , Prepare for your Python Certification PCAP-31-03 (2024) with 6 Practice Tests - Detailed Explanations ...",
      "url": "https://www.udemy.com/course/python-pcap-31-03-certification-practice-exam-preparation/?couponCode=AA12B1022FAFC980FE2D",
      "clean_url": "https://www.udemy.com/course/python-pcap-31-03-certification-practice-exam-preparation/"
    },
    {
      "name": "PYTHON INTERVIEW PREPARATION",
      "category": "IT & Software",
      "image": "https://img-c.udemycdn.com/course/480x270/6060673_b355.jpg",
      "actual_price_usd": 799000.0,
      "sale_price_usd": 0.0,
      "sale_end": "2025-01-22T20:00:00",
      "description": "PYTHON INTERVIEW PREPARATION, Prepare for Python Interviews With A Wide Variety Of In-Depth Practice Questions.\r\n\r\n \r\nCourse Description\r\n\r\n\r\n\r\n\r\nEmbark ...",
      "url": "https://www.udemy.com/course/python-interview-prep/?couponCode=7ECA8DA5B25ED958EE32",
      "clean_url": "https://www.udemy.com/course/python-interview-prep/"
    }
  ]
}
